In [1]:
import pandas as pd

In [3]:
# DataFrame is a class and we are calling __init__ method fromt that class, I am using method for pd.DataFrame
# we prefer csv file creation than dataFrame creation.

## When data is arranged in columns:

In [7]:
names = ['Rahul', 'Prince', 'Spartan']
hobbies = ['Coding', 'Pc Games', 'Judo']
height = ['175 cm', '170 cm', '165 cm']

In [8]:
information = pd.DataFrame({'Name': names, 'Hobbies': hobbies, 'Height': height})

In [9]:
information

      Name   Hobbies  Height
0    Rahul    Coding  175 cm
1   Prince  Pc Games  170 cm
2  Spartan      Judo  165 cm

In [10]:
type(information)

pandas.core.frame.DataFrame

In [13]:
information.set_index('Name', inplace = True)

In [14]:
information

          Hobbies  Height
Name
Rahul      Coding  175 cm
Prince   Pc Games  170 cm
Spartan      Judo  165 cm

## When data is arranged in Rows:

In [15]:
row1 = ['Rahul', 'Coding', '175 cm']
row2 = ['Jack', 'pc games', '170 cm']
row3 = ['Harry', 'broom', '165 cm']

In [16]:
info2 = pd.DataFrame(data = [row1, row2, row3], columns = ['Names', 'Hobbies', 'Height'])

In [17]:
info2

   Names   Hobbies  Height
0  Rahul    Coding  175 cm
1   Jack  pc games  170 cm
2  Harry     broom  165 cm

In [19]:
info2.set_index('Names', inplace = True)

In [20]:
info2

        Hobbies  Height
Names
Rahul    Coding  175 cm
Jack   pc games  170 cm
Harry     broom  165 cm

In [18]:
# This is how we can create our dataFrame using either arranging columns or rows....

In [21]:
# There is still other way to create DataFrame:
# lets use Series:
ser = pd.Series(data = hobbies)

In [23]:
ser

0      Coding
1    Pc Games
2        Judo
dtype: object

In [24]:
type(ser)

pandas.core.series.Series

In [31]:
# Now lets convert this series to DataFrame:
ser_to_df = pd.Series(data = hobbies, name = 'Hobbies').to_frame()

In [32]:
ser_to_df

    Hobbies
0    Coding
1  Pc Games
2      Judo

In [33]:
type(ser_to_df)

pandas.core.frame.DataFrame

In [37]:
# This is how we can add columns:
ser_to_df['Height'] = height

In [38]:
ser_to_df

    Hobbies  Height
0    Coding  175 cm
1  Pc Games  170 cm
2      Judo  165 cm

### Source: https://www.youtube.com/playlist?list=PLwgFb6VsUj_nFnLLn3M8iacrhDyXqE4N9